"use strict";

function imageUrl(imageNumber) {
    return 'https://xxx/yyy/zzz' + imageNumber + '.png';
}

const wordFitMap = new Map([
    ['普通', [100, 0, 0, 0, 0, 0]],
    ['怒って', [0, 100, 0, 0, 0, 0]],
    ['笑って', [0, 0, 100, 0, 0, 0]],
    ['びっくり', [0, 0, 0, 100, 0, 0]],
    ['泣いて', [0, 0, 0, 0, 100, 0]],
    ['だめ', [0, 0, 0, 0, 0, 100]],
    ['おはよう', [0, 0, 100, 30, 0, 0]],
    ['おはようございます', [0, 0, 100, 30, 0, 0]],
    ['こんにちわ', [30, 0, 100, 0, 0, 0]],
    ['こんばんわ', [30, 0, 100, 0, 0, 0]],
    ['おやすみ', [0, 0, 100, 0, 30, 0]],
    ['おやすみなさい', [0, 0, 100, 0, 30, 0]],
    ['なんでもない', [100, 0, 0, 0, 20, 30]],
    ['好き', [0, 0, 30, 100, 0, 30]],
    ['嫌い', [0, 50, 0, 100, 0, 50]],
    ['適当', [50, 50, 50, 50, 50, 50]],
    ['ランダム', [50, 50, 50, 50, 50, 50]],
    ['ありがとう', [0, 0, 100, 0, 0, 0]],
    ['さようなら', [0, 0, 0, 0, 100, 0]],
]);

module.exports = {
    wordFitMap: wordFitMap,
    imageUrl: imageUrl,
};